"""
在Python中定义函数可以用必须参数、关键字参数、默认参数和可变关键字参数，这4种
参数可以组合使用。
注意定义参数的顺序必须是：必须参数、默认参数、可变参数、关键字参数。
"""


def exp(p1, p2, df=0, *vart, **kw):
    print('p1=', p1, 'p2=', p2, 'df=', df, 'vart=', vart, 'kw=', kw)


exp(1, 2)
exp(1, 2, c=3)
exp(1, 2, 3, 'a', 'b')
exp(1, 2, 3, 'abc', x=9)
"""
p1= 1 p2= 2 df= 0 vart= () kw= {}
p1= 1 p2= 2 df= 0 vart= () kw= {'c': 3}
p1= 1 p2= 2 df= 3 vart= ('a', 'b') kw= {}
p1= 1 p2= 2 df= 3 vart= ('abc',) kw= {'x': 9}
"""

# 由输出结果看，使用了组合参数，调用函数时，Python解释器会自动按照参数位置和参数名把对应的参数传进去
# 还可以用tuple和dict调用上述函数，使用方式如下
args = (2, 2, 3, 4)  # 定义tuple
kw = {'x': 8, 'y': '9'}  # 定义dict
exp(*args, **kw)  # p1= 2 p2= 2 df= 3 vart= (4,) kw= {'x': 8, 'y': '9'}
# 为什么是上面这样的输出结果？
